Revit 2027 API
ReinforcementAbbreviationTagType Enumeration
 Defines all types of abbreviation tags for Area and Path Reinforcement objects.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ReinforcementAbbreviationTagType
Public Enumeration ReinforcementAbbreviationTagType
public enum class ReinforcementAbbreviationTagType
type ReinforcementAbbreviationTagType
Members
Member name | Value | Description
AreaReinforcementBottomMajor | 2 |  Area Reinforcement - slab bottom for major direction.
AreaReinforcementBottomMinor | 3 |  Area Reinforcement - slab bottom for minor direction.
AreaReinforcementExteriorMajor | 6 |  Area Reinforcement - wall exterior for major direction.
AreaReinforcementExteriorMinor | 7 |  Area Reinforcement - wall exterior for minor direction.
AreaReinforcementInteriorMajor | 4 |  Area Reinforcement - wall interior for major direction.
AreaReinforcementInteriorMinor | 5 |  Area Reinforcement - wall interior for minor direction.
AreaReinforcementLayerEachFace | 9 |  Area Reinforcement - layer for each face
AreaReinforcementLayerEachWay | 8 |  Area Reinforcement - layer for each way
AreaReinforcementTopMajor | 0 |  Area Reinforcement - slab top for major direction.
AreaReinforcementTopMinor | 1 |  Area Reinforcement - slab top for minor direction.
PathReinforcementAlternating | 14 |  Path Reinforcement - alternating.
PathReinforcementAlternatingBarOffset | 15 |  Path Reinforcement - alternating bar offset.
PathReinforcementBottom | 11 |  Path Reinforcement - slab bottom.
PathReinforcementExterior | 13 |  Path Reinforcement - wall exterior.
PathReinforcementInterior | 12 |  Path Reinforcement - wall interior.
PathReinforcementTop | 10 |  Path Reinforcement - slab top.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace